UCB_CS61_lec37.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session Amortized Analysis
#+PROPERTY: header-args:ipython :session Amortized Analysis
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十七课: Amortized Analysis
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


- Randomized analysis， 要求的是广度;
- Amortized  analysis， 要求的是深度;

广度的意思是说，我希望样本的分布更均匀，像 quicksort(pivot)，hashtable(hashcode)，
有依赖随机的属性。这个属性会影响算法结果。深度的意思是说，我的结果依赖于我之前执
行的次数，执行的越多越好，有点像循环进化的意思，比如 disjoint set(path
compression), splaytree
* AMORTIZED ANALYSIS in hash table api
首先必须明确，Amortized analysis 给我们的是一个算法的 upper-bound(big O) running time.

We've seen several data structures for which I claimed that the average time
for certain operations is always better than the worst-case time:  hash tables,
tree-based disjoint sets, and splay trees.

The mathematics that proves these claims is called _amortized_analysis_.
Amortized analysis is a way of proving that even if an operation is
occasionally expensive, its cost is made up for by earlier, cheaper operations.

there are two different ways in which an alogrithm can be better than its worst case time:

| Amortized analysis                              | Randomized  analysis                     |
|-------------------------------------------------+------------------------------------------|
| occasional operation that's very slow           | uses randomization to make itself faster |
|-------------------------------------------------+------------------------------------------|
| hash table, disjoint sets, splay tree           | hash table, quickSort, quickSelect       |
|-------------------------------------------------+------------------------------------------|
| one is occasional operation that's very slow    | uses randomization to make itself faster |
| but most of the operations are much faster when | depend on the probilistic distribution   |
| you do a bunch of operations                    |                                          |

** The Averaging Method

Most hash table operations take O(1) time, but sometimes an operation forces a
hash table to resize itself, at great expense.

: What is the average time to insert an item into a hash table with resizing?

Assume that the chains never grow longer than O(1), so any operation that
doesn't resize the table takes O(1) time--more precisely, suppose it takes at
most one second.

Let n be the number of items in the hash table, and N the number of buckets.
Suppose it takes one second for the insert operation to insert the new item,
increment n, and then check if n = N. If so, it doubles the size of the table
from N to 2N, taking 2N additional seconds. This resizing scheme ensures that
the load factor n/N is always less than one.

虽然我们是想考察‘由于插入引起 hashtable 扩容数组’所引起的时间消耗，但我们不是直接分析这步操作，
我们要分析 average running time, 所以我们从一个‘空’的数据结构开始，这也是所有 Amortized
analysis 的前提，假设一切从头开始从‘空’开始一步步生成 hashtable。

Suppose every newly constructed hash table is empty and has just one bucket--
that is, initially n = 0 and N = 1.  After i insert operations, n = i.  The
number of buckets N must be a power of two, and we never allow it to be less
than or equal to n; so N is the smallest power of two > n, which is <= 2n.
这里好像是假设，数组扩容一个单位耗费 1 妙，往数组中写入一个值也耗费 1 妙。

The total time in seconds for _all_ the table resizing operations is

#+BEGIN_EXAMPLE
    2 + 4 + 8 + ... + N/4 + N/2 + N = 2N - 2.
#+END_EXAMPLE

So the cost of i insert operations is at most ~i + 2N - 2~ seconds. Because ~N
<= 2n = 2i~, the i insert operations take ~<= 5i - 2~ seconds. Therefore, the
_average_ running time of an insertion operation is

#+BEGIN_EXAMPLE
(5i - 2)/i = 5 - 2/i
    O(i)/i = O(1)
#+END_EXAMPLE

seconds, which is in O(1) time.

: We say that the _amortized_running_time_ of insertion is in O(1), even though the worst-case running time is in Theta(n).

For almost any application, the amortized running time is more important than
the worst-case running time, because the amortized running time determines the
total running time of the application.  The main exceptions are some
applications that require fast interaction (like video games), for which one
really slow operation might cause a noticeable glitch in response time.
*** Disadvantage of average method
虽然 average method 很方便的衡量了 insert()操作的平均时间，但 average method 没
法处理和估计 delete() 的时间，因为你通过 insert()增加元素，通过 delete()减少元素，
两者可以有无数种组合，没法把他们都加起来然后平均。
