UCB_CS61_lec37.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 19:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十七课: Amortized Analysis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十七课: Amortized Analysis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge244177">1. AMORTIZED ANALYSIS in hash table api</a>
<ul>
<li><a href="#org930e176">1.1. The Averaging Method</a>
<ul>
<li><a href="#orgec4af6b">1.1.1. Disadvantage of average method</a></li>
</ul>
</li>
<li><a href="#orgd1fb9f2">1.2. The Accounting Method</a></li>
<li><a href="#org0ee03e5">1.3. Accounting of Hash Tables</a>
<ul>
<li><a href="#org41bcc41">1.3.1. Identify when amortize and actual difference</a></li>
<li><a href="#orgd322de1">1.3.2. By trial and error, we give a guess about cost of api</a></li>
<li><a href="#orgede4da5">1.3.3. Varify whether our guess is right or wrong</a></li>
<li><a href="#org0d172af">1.3.4. how to analyse the dollars in bank by insert()</a></li>
<li><a href="#org64c9b07">1.3.5. advantage by using formula n and N</a></li>
<li><a href="#org20d7f04">1.3.6. the same with delete()</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org09b6206">2. Why Does Amortized Analysis Work?</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>Randomized analysis， 要求的是广度;</li>
<li>Amortized  analysis， 要求的是深度;</li>
</ul>

<p>
广度的意思是说，我希望样本的分布更均匀，像 quicksort(pivot)，hashtable(hashcode)，有依赖随机的属性。这个属性会影响算法结果。深度的意思是说，我的结果依赖于我之前执行的次数，执行的越多越好，有点像循环进化的意思，比如 disjoint set(path
compression), splaytree
</p>
<div id="orge244177" class="outline-2">
<h2 id="orge244177"><span class="section-number-2">1</span> AMORTIZED ANALYSIS in hash table api</h2>
<div class="outline-text-2" id="text-1">
<p>
首先必须明确，Amortized analysis 给我们的是一个算法的 upper-bound(big O) running time.
</p>

<p>
We've seen several data structures for which I claimed that the average time
for certain operations is always better than the worst-case time:  hash tables,
tree-based disjoint sets, and splay trees.
</p>

<p>
The mathematics that proves these claims is called <span class="underline">amortized_analysis</span>.
Amortized analysis is a way of proving that even if an operation is
occasionally expensive, its cost is made up for by earlier, cheaper operations.
</p>

<p>
there are two different ways in which an alogrithm can be better than its worst case time:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Amortized analysis</th>
<th scope="col" class="org-left">Randomized  analysis</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">occasional operation that's very slow</td>
<td class="org-left">uses randomization to make itself faster</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">hash table, disjoint sets, splay tree</td>
<td class="org-left">hash table, quickSort, quickSelect</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">one is occasional operation that's very slow</td>
<td class="org-left">uses randomization to make itself faster</td>
</tr>

<tr>
<td class="org-left">but most of the operations are much faster when</td>
<td class="org-left">depend on the probilistic distribution</td>
</tr>

<tr>
<td class="org-left">you do a bunch of operations</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="org930e176" class="outline-3">
<h3 id="org930e176"><span class="section-number-3">1.1</span> The Averaging Method</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Most hash table operations take O(1) time, but sometimes an operation forces a
hash table to resize itself, at great expense.
</p>

<pre class="example">
What is the average time to insert an item into a hash table with resizing?

</pre>

<p>
Assume that the chains never grow longer than O(1), so any operation that
doesn't resize the table takes O(1) time&#x2013;more precisely, suppose it takes at
most one second.
</p>

<p>
Let n be the number of items in the hash table, and N the number of buckets.
Suppose it takes one second for the insert operation to insert the new item,
increment n, and then check if n = N. If so, it doubles the size of the table
from N to 2N, taking 2N additional seconds. This resizing scheme ensures that
the load factor n/N is always less than one.
</p>

<p>
虽然我们是想考察‘由于插入引起 hashtable 扩容数组’所引起的时间消耗，但我们不是直接分析这步操作，我们要分析 average running time, 所以我们从一个‘空’的数据结构开始，这也是所有 Amortized
analysis 的前提，假设一切从头开始从‘空’开始一步步生成 hashtable。
</p>

<p>
Suppose every newly constructed hash table is empty and has just one bucket&#x2013;
that is, initially n = 0 and N = 1.  After i insert operations, n = i.  The
number of buckets N must be a power of two, and we never allow it to be less
than or equal to n; so N is the smallest power of two &gt; n, which is &lt;= 2n.
这里好像是假设，数组扩容一个单位耗费 1 妙，往数组中写入一个值也耗费 1 妙。
</p>

<p>
The total time in seconds for <span class="underline">all</span> the table resizing operations is
</p>

<pre class="example">
2 + 4 + 8 + ... + N/4 + N/2 + N = 2N - 2.
</pre>

<p>
So the cost of i insert operations is at most <code>i + 2N - 2</code> seconds. Because <code>N
&lt;= 2n = 2i</code>, the i insert operations take <code>&lt;= 5i - 2</code> seconds. Therefore, the
<span class="underline">average</span> running time of an insertion operation is
</p>

<pre class="example">
(5i - 2)/i = 5 - 2/i
    O(i)/i = O(1)
</pre>

<p>
seconds, which is in O(1) time.
</p>

<pre class="example">
We say that the _amortized_running_time_ of insertion is in O(1), even though the worst-case running time is in Theta(n).

</pre>

<p>
For almost any application, the amortized running time is more important than
the worst-case running time, because the amortized running time determines the
total running time of the application.  The main exceptions are some
applications that require fast interaction (like video games), for which one
really slow operation might cause a noticeable glitch in response time.
</p>
</div>
<div id="orgec4af6b" class="outline-4">
<h4 id="orgec4af6b"><span class="section-number-4">1.1.1</span> Disadvantage of average method</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
虽然 average method 很方便的衡量了 insert()操作的平均时间，但 average method 没法处理和估计 delete() 的时间，因为你通过 insert()增加元素，通过 delete()减少元素，两者可以有无数种组合，没法把他们都加起来然后平均。
</p>
</div>
</div>
</div>
