UCB_CS61_lec37.org
** The Accounting Method

Consider hash tables that resize in both directions:  not only do they expand
as the number of items increases, but they also shrink as the number of items
decreases.  You can't analyze them with the averaging method, because you don't
know what sequence of insert and remove operations an application might
perform.

Let's try a more sophisticated method.  In the _accounting_method_, we "charge"
each operation a certain amount of time.  Usually we overcharge.  When we
charge more time than the operation actually takes, we can save the excess time
in a bank to spend on later operations.

Before we start, let's stop using seconds as our unit of running time.  We
don't actually know how many seconds any computation takes, because it varies
from computer to computer.  However, everything a computer does can be broken
down into a sequence of constant-time computations.  Let a _dollar_ be a unit
of time that's long enough to execute the slowest constant-time computation
that comes up in the algorithm we're analyzing.  A dollar is a real unit of
time, but it's different for different computers.

Each hash table operation has
- an _amortized_cost_, which is the number of dollars that we "charge" to do
  that operation, and
- an _actual_cost_, which is the actual number of constant-time computations
  the operation performs.

  #+BEGIN_EXAMPLE
if amortized cost > actual cost,
   比如 amortize 估计每几步操作就会产生 resize hashtable，
   但实际上，代码中并不考虑快满了就 resize hashtable 的情况。
   extra dollars saved in an imaginary bank to be spend in later operations

if actual cost > amortized cost,
   比如 amortize 估计没几步操作就会产生 resize hashtable,
   但实际上，代码中每进行一次操作，都会 resize hashtable。
   that means you have to withdraw money from the bank to pay for you overcharge
  #+END_EXAMPLE


The amortized cost is usually a fixed function of n (e.g. $5 for insertion into
a hash table, or $2 log n for insertion into a splay tree), but the actual cost
may vary wildly from operation to operation.  For example, insertion into a
hash table takes a long, long time when the table is resized.

When an operation's amortized cost exceeds its actual cost, the extra dollars
are saved in the bank to be spent on later operations.  When an operation's
actual cost exceeds its amortized cost, dollars are withdrawn from the bank to
pay for an unusually expensive operation.

If the bank balance goes into surplus, it means that the actual total running
time is even faster than the total amortized costs imply.

THE BANK BALANCE MUST NEVER FALL BELOW ZERO.  If it does, you are spending more
total dollars than your budget claims, and you have failed to prove anything
about the amortized running time of the algorithm.

Think of amortized costs as an allowance.  If your dad gives you $500 a month
allowance, and you only spend $100 of it each month, you can save up the
difference and eventually buy a car.  The car may cost $30,000, but if you
saved that money and don't go into debt, your _average_ spending obviously
wasn't more than $500 a month.

** Accounting of Hash Tables
*** Identify when amortize and actual difference
Suppose every operation (insert, find, remove) takes one dollar of actual
running time unless the hash table is resized.  We resize the table in two
circumstances.
- An insert operation doubles the table size if n = N AFTER the new item is
  inserted and n is incremented, taking 2N additional dollars of time for
  resizing to 2N buckets. Thus, the load factor is always less than one.
- The remove operation halves the table size if n = N/4 AFTER the item is
  deleted and n is decremented, taking N additional dollars of time for
  resizing to N/2 buckets.  Thus, the load factor is always greater than 0.25
  (except when n = 0, i.e. the table is empty).

Either way, a hash table that has _just_ been resized has n = N/2.
A newly constructed hash table has n = 0 items and N = 1 buckets.
*** By trial and error, we give a guess about cost of api
By trial and error, I came up with the following amortized costs.

#+BEGIN_EXAMPLE
    insert:  5 dollars
    remove:  5 dollars
    find:    1 dollar
    为什么 find cost 很少，因为他永远不会 resize hashtable
#+END_EXAMPLE
*** Varify whether our guess is right or wrong
*value of n and N when start accouting*

     #+BEGIN_EXAMPLE
    下面的事情就是来验证，我们对 api()消耗所做出的猜测是否正确
    假设 n 和 N 是当 hashtable 为空或者刚刚 resize 后的值
             这里的假设就和 average method 不一样，average method 是假设一切从零开始，hashtable
             一开始也是空的，慢慢插入;
             accounting method 假设是 empty or just resized，空或者刚刚被 resize 过。

    这样假设之后，n 在每一次开始时（empty or just resized）
    都处在[N/2 - 1, N/2 + 1]之间, 注意这里的 N 是经过 resize 之后的 hashtable 大小。
             比如，一开始 N = 8, n = 8
             insert(), ==> N = 8*2 = 16, n = 8 + 1 = 9
                       ==> n = 16/2 + 1 = _N/2 + 1_;
             比如，一开始 N = 8, n = 2
             delete(), ==> N = 8/2 =4,   n = 2 - 1 = 1
                       ==> n = 4/2 -1   = _N/2 - 1_;
     #+END_EXAMPLE

*our target*

     最重要的是通过这个公式，我们不用知道之前操作的时间消耗([[*Disadvantage of average method][combination of
     series of operations]])，我们可以直接通过现在的 n 和 N 估算出目前银行里存有多
     少 dollars。只要我们可以估算出，in a long term, 银行里的前不会小于 0（实际
     时间消耗 < 估算时间消耗）,即可。

