UCB_CS61_lec37.html

<div id="org0d172af" class="outline-4">
<h4 id="org0d172af"><span class="section-number-4">1.3.4</span> how to analyse the dollars in bank by insert()</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
We charge an amortized $5 for an insert or remove operation.  Every insert or
remove operation costs one actual dollar (not counting resizing) and puts the
remaining $4 in the bank to pay for resizing.  For every step n takes away from
N/2, we accumulate another $4.
</p>

<p>
So, when encount a 'resize', there must be at least 4*|n - N/2| dollars
saved (or 4n dollars for a never-resized one-bucket hash table).
</p>

<p>
An insert operation only resizes the table if the number of items n reaches
N. According to the formula 4|n - N/2|, there are at least 2N dollars in
the bank.
</p>

<p>
Resizing the hash table from N to 2N buckets costs 2N dollars, so we can
afford it.
</p>

<p>
After we resize, the bank balance might be zero again, but it isn't negative.
</p>

<p>
比如，一开始 N = 9, n = 16
</p>
<pre class="example">
|------------------------------+-------------------+-----+----|----\
| insert(), ==&gt; n = 10, N = 16 | actual_cost = 1$  |     |    |    |
|                              | amortized   = 5$  |   4 |  4 |    |
|------------------------------+-------------------+-----+----|    |
| insert(), ==&gt; n = 11, N = 16 | actual_cost = 1$  |     |    |    |
|                              | amortized   = 5$  |   4 |  8 |    |
|------------------------------+-------------------+-----+----|    |
| insert(), ==&gt; n = 12, N = 16 | actual_cost = 1$  |     |    |    |
|                              | amortized   = 5$  |   4 | 12 |    |&gt; &lt;&lt;store dollars&gt;&gt;   |
|------------------------------+-------------------+-----+----|    |                      |
| insert(), ==&gt; n = 13, N = 16 | actual_cost = 1$  |     |    |    |                      |
|                              | amortized   = 5$  |   4 | 16 |    |                      |
|------------------------------+-------------------+-----+----|    |                      |
| insert(), ==&gt; n = 14, N = 16 | actual_cost = 1$  |     |    |    |                      |
|                              | amortized   = 5$  |   4 | 20 |    |                      |&gt; 一轮一轮的看,整体 dollars 总是&gt;0
|------------------------------+-------------------+-----+----|    |                      |
| insert(), ==&gt; n = 15, N = 16 | actual_cost = 1$  |     |    |    |                      |
|                              | amortized   = 5$  |   4 | 24 |    |                      |
|------------------------------+-------------------+-----+----|    |                      |
| insert(), ==&gt; n = 16, N = 16 | actual_cost = 1$  |     |    |    |                      |
|                              | amortized   = 5$  |   4 | 28 |----/                      |
|------------------------------+-------------------+-----+----|                           |
| insert(), ==&gt; n = 17, N = 32 | actual_cost = 32$ | -27 |  1 |----&gt; &lt;&lt;withdraw dollars&gt;&gt; |
|                              | amortized   = 5$  |     |    |
</pre>


<pre class="example">
4|n - N/2| 这里的 n 是指在 N/2+1 ~ N 之间游走时，会一直[[store dollars]]。
当 n = N+1 的时候开始 [[withdraw dollars]]


当 n = N+1, 会导致 N--&gt;2N, 这里重新分配一个 2N 大小的数组，消耗 2N dollars 时间。
但我总体来看，一轮一轮的看，银行里的 dollars 不会小于 0,所以 amortized 估计总是大于 actual
所以：
       insert:  5 dollars
       remove:  5 dollars
       find:    1 dollar
是合理的。
</pre>
</div>
</div>
<div id="org64c9b07" class="outline-4">
<h4 id="org64c9b07"><span class="section-number-4">1.3.5</span> advantage by using formula n and N</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
IMPORTANT:  Note that 4|n - N/2| is a function of the data structure, and does
NOT depend on the history of hash table operations performed.
</p>

<p>
The crucial insight is that at any time, we can look at a hash table and know a
lower bound for how many dollars are in the bank from the values of n and N.
</p>

<p>
In general, the accounting method only works if you can tell how much
money is in the bank (or, more commonly, a minimum bound on that bank
balance) just by looking at the current state of the data
structure&#x2013;without knowing how the data structure reached that state.
</p>

<p>
We know that the last time the hash table was resized, the number of items n
was exactly N/2.  So if n != N/2, there have been subsequent insert/remove
operations, and these have put money in the bank.
</p>
</div>
</div>

<div id="org20d7f04" class="outline-4">
<h4 id="org20d7f04"><span class="section-number-4">1.3.6</span> the same with delete()</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
A remove operation only resizes the table if the number of items n drops to
N/4.  According to the formula 4|n - N/2|, there are at least N dollars in the
bank.  Resizing the hash table from N to N/2 buckets costs N dollars, so we can
afford it.
</p>

<p>
The bank balance never drops below zero, so my amortized costs above are valid.
Therefore, the amortized cost of all three operations is in O(1).
</p>

<p>
      Observe that if we alternate between inserting and deleting the same item over
      and over, the hash table is never resized, so we save up a lot of money in the
      bank.  This isn't a problem; it just means the algorithm is faster (spends
      fewer dollars) than my amortized costs indicate.

</p>
</div>
</div>
</div>
</div>
<div id="org09b6206" class="outline-2">
<h2 id="org09b6206"><span class="section-number-2">2</span> Why Does Amortized Analysis Work?</h2>
<div class="outline-text-2" id="text-2">
<p>
Why does this metaphor about putting money in the bank tell us anything about
the actual running time of an algorithm?
</p>

<p>
Suppose our accountant keeps a ledger with two columns:  the total amortized
cost of all operations so far, and the total actual cost of all operations so
far.  Our bank balance is the sum of all the amortized costs in the left
column, minus the sum of all the actual costs in the right column.  If the bank
balance never drops below zero, the total actual cost is less than or equal to
the total amortized cost.
</p>

<pre class="example">
Total amortized cost  |  Total actual cost
------------------------------------------
         $5           |          $1
         $1           |          $1
         $5           |          $3
          .           |           .
          .           |           .
          .           |           .
         $5           |          $1
         $5           |      $2,049
         $1           |          $1
------------------------------------------
    $12,327           &gt;=    $10,333
</pre>

<p>
Therefore, the total running time of all the actual operations is never longer
than the total amortized cost of all the operations.
</p>

<p>
Amortized analysis (as presented here) only tells us an <span class="underline">upper bound (big-Oh)</span>
on the actual running time, and not a lower bound (big-Omega) . It might happen
that we accumulate a big bank balance and never spend it, and the total actual
running time might be much less than the amortized cost.
</p>

<p>
For example, splay tree operations take amortized O(log n) time, where n is the
number of items in the tree, but if your only operation is to find the same
item n times in a row, the actual average running time is in O(1).
</p>

<p>
If you want to see the amortized analysis of splay trees, Goodrich and Tamassia
have it. If you take CS 170, you'll see an amortized analysis of disjoint sets.
I am saddened to report that both analyses are too complicated to provide much
intuition about their running times. (Especially the inverse Ackermann
function, which is ridiculously nonintuitive, though cool nonetheless.)
</p>
</div>
</div>
</div>
</body>
</html>
